In [1]:
from sqlalchemy import create_engine
import pandas as pd   
import numpy as np  
import matplotlib.pyplot as plt  
import seaborn as sns

In [2]:
database_name = 'scooters'

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

engine = create_engine(connection_string)

In [3]:
query = '''
SELECT *
FROM scooters
limit 800;
'''

In [4]:
with engine.connect() as connection:
    test = pd.read_sql(query, con = connection)

test.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird

In [5]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pubdatetime  800 non-null    datetime64[ns]
 1   latitude     800 non-null    float64
 2   longitude    800 non-null    float64
 3   sumdid       800 non-null    object
 4   sumdtype     800 non-null    object
 5   chargelevel  800 non-null    float64
 6   sumdgroup    800 non-null    object
 7   costpermin   800 non-null    float64
 8   companyname  800 non-null    object
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 56.4+ KB

In [6]:
text = '''
SELECT COUNT(sumdgroup)
FROM scooters
WHERE sumdgroup <> 'bicycle';
'''
with engine.connect() as connection:
    scooter_count = pd.read_sql(text, con = connection)
scooter_count

      count
0  73387514

770 nulls(in Scooters table) out of 73414043 entries

In [7]:
text = '''
SELECT min(pubdatetime), max(pubdatetime)
FROM scooters;
'''
with engine.connect() as connection:
    times_scooters = pd.read_sql(text, con = connection)
times_scooters

                      min                 max
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

In [8]:
text = '''
SELECT min(pubtimestamp), max(pubtimestamp)
FROM trips;
'''
with engine.connect() as connection:
    times_trips = pd.read_sql(text, con = connection)
times_trips

                      min                 max
0 2019-05-01 00:00:55.423 2019-08-01 07:04:00

In [9]:
text = '''
SELECT *
FROM trips
LIMIT 100;
'''
with engine.connect() as connection:
    test2 = pd.read_sql(text, con = connection)
test2.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [10]:
text = '''
SELECT COUNT(DISTINCT sumdid), companyname
FROM trips
GROUP BY companyname;
'''
with engine.connect() as connection:
    company_scooters_trips = pd.read_sql(text, con = connection)
company_scooters_trips

   count    companyname
0   3766           Bird
1    356  Bolt Mobility
2    166         Gotcha
3    450           JUMP
4   1788           Lime
5   1725           Lyft
6    754           SPIN

In [11]:
text = '''
SELECT COUNT(DISTINCT sumdid), companyname
FROM scooters
WHERE sumdgroup <> 'bicycle'
GROUP BY companyname;
'''
with engine.connect() as connection:
    company_scooters_scooters = pd.read_sql(text, con = connection)
company_scooters_scooters

   count companyname
0   3860        Bird
1    360        Bolt
2    224      Gotcha
3   1210        Jump
4   1818        Lime
5   1735        Lyft
6    805        Spin

In [12]:
text = '''
SELECT COUNT(DISTINCT sumdid), companyname
FROM scooters
WHERE sumdgroup like 'Scooter'
GROUP BY companyname;
'''
with engine.connect() as connection:
    test3 = pd.read_sql(text, con = connection)
test3

   count companyname
0    360        Bolt
1    224      Gotcha
2    805        Spin

In [13]:
text = '''
SELECT COUNT(sumdid), sumdgroup
FROM scooters
GROUP BY sumdgroup;
'''
with engine.connect() as connection:
    sumdgroup_counts = pd.read_sql(text, con = connection)
sumdgroup_counts

      count sumdgroup
0     26529   bicycle
1  59671463   scooter
2  13716051   Scooter

In [17]:
text = '''
SELECT COUNT(DISTINCT sumdid)
FROM trips;
'''
with engine.connect() as connection:
    total_trips = pd.read_sql(text, con = connection)
total_trips

   count
0   9005

In [19]:
text = '''
SELECT 
    sumdid, 
    AVG(COUNT(sumdid)) OVER(PARTITION BY COUNT(DISTINCT enddate)) AS count_per_day
FROM trips
GROUP BY sumdid;
'''
with engine.connect() as connection:
    counts_per_day = pd.read_sql(text, con = connection)
counts_per_day

                    sumdid  count_per_day
0     Powered4ULNCUG73ZJ3Y       1.965616
1     PoweredJYPBFJF4AAE3C       1.965616
2            Powered587699       1.965616
3            Powered586203       1.965616
4             PoweredTZW4T       1.965616
...                    ...            ...
9000  PoweredWZLC7D3TEMPS2     315.500000
9001  PoweredTVZN3QVMMQ5UK     315.500000
9002  PoweredCL37MXJKM7RS5     352.000000
9003  Powered4ZPLZX2G755LW     340.000000
9004        PoweredUNKNOWN    3613.000000

[9005 rows x 2 columns]

In [16]:
more_than_3= counts_per_day[counts_per_day['count_per_day']>3]
more_than_3

                                           sumdid  count_per_day
349   Powered97f8a3a1-959b-5750-8cb6-67c9f7bcf261       4.430605
350                                  Powered8NPNR       4.430605
351                                  Powered1HQLA       4.430605
352                                  PoweredYI3IR       4.430605
353                          PoweredTNJ6VY3YPJN2U       4.430605
...                                           ...            ...
9000                         PoweredWZLC7D3TEMPS2     315.500000
9001                         PoweredTVZN3QVMMQ5UK     315.500000
9002                         PoweredCL37MXJKM7RS5     352.000000
9003                         Powered4ZPLZX2G755LW     340.000000
9004                               PoweredUNKNOWN    3613.000000

[8656 rows x 2 columns]